copenhagenatomics/CA_Embedded_Libraries/unit_testing/fakes/fake_stm32f401xc.h
// /*!< Peripheral memory map */
// #define APB1PERIPH_BASE       PERIPH_BASE
// #define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
// #define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
// #define AHB2PERIPH_BASE       (PERIPH_BASE + 0x10000000UL)

// /*!< APB1 peripherals */
// #define TIM2_BASE             (APB1PERIPH_BASE + 0x0000UL)
// #define TIM3_BASE             (APB1PERIPH_BASE + 0x0400UL)
// #define TIM4_BASE             (APB1PERIPH_BASE + 0x0800UL)
// #define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00UL)
// #define RTC_BASE              (APB1PERIPH_BASE + 0x2800UL)
// #define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00UL)
// #define IWDG_BASE             (APB1PERIPH_BASE + 0x3000UL)
// #define I2S2ext_BASE          (APB1PERIPH_BASE + 0x3400UL)
// #define SPI2_BASE             (APB1PERIPH_BASE + 0x3800UL)
// #define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00UL)
// #define I2S3ext_BASE          (APB1PERIPH_BASE + 0x4000UL)
// #define USART2_BASE           (APB1PERIPH_BASE + 0x4400UL)
// #define I2C1_BASE             (APB1PERIPH_BASE + 0x5400UL)
// #define I2C2_BASE             (APB1PERIPH_BASE + 0x5800UL)
// #define I2C3_BASE             (APB1PERIPH_BASE + 0x5C00UL)
// #define PWR_BASE              (APB1PERIPH_BASE + 0x7000UL)

// /*!< APB2 peripherals */
// #define TIM1_BASE             (APB2PERIPH_BASE + 0x0000UL)
// #define USART1_BASE           (APB2PERIPH_BASE + 0x1000UL)
// #define USART6_BASE           (APB2PERIPH_BASE + 0x1400UL)
// #define ADC1_BASE             (APB2PERIPH_BASE + 0x2000UL)
// #define ADC1_COMMON_BASE      (APB2PERIPH_BASE + 0x2300UL)
// /* Legacy define */
// #define ADC_BASE               ADC1_COMMON_BASE
// #define SDIO_BASE             (APB2PERIPH_BASE + 0x2C00UL)
// #define SPI1_BASE             (APB2PERIPH_BASE + 0x3000UL)
// #define SPI4_BASE             (APB2PERIPH_BASE + 0x3400UL)
// #define SYSCFG_BASE           (APB2PERIPH_BASE + 0x3800UL)
// #define EXTI_BASE             (APB2PERIPH_BASE + 0x3C00UL)
// #define TIM9_BASE             (APB2PERIPH_BASE + 0x4000UL)
// #define TIM10_BASE            (APB2PERIPH_BASE + 0x4400UL)
// #define TIM11_BASE            (APB2PERIPH_BASE + 0x4800UL)

// /*!< AHB1 peripherals */
// #define GPIOA_BASE            (AHB1PERIPH_BASE + 0x0000UL)
// #define GPIOB_BASE            (AHB1PERIPH_BASE + 0x0400UL)
// #define GPIOC_BASE            (AHB1PERIPH_BASE + 0x0800UL)
// #define GPIOD_BASE            (AHB1PERIPH_BASE + 0x0C00UL)
// #define GPIOE_BASE            (AHB1PERIPH_BASE + 0x1000UL)
// #define GPIOH_BASE            (AHB1PERIPH_BASE + 0x1C00UL)
// #define CRC_BASE              (AHB1PERIPH_BASE + 0x3000UL)
// #define RCC_BASE              (AHB1PERIPH_BASE + 0x3800UL)
// #define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x3C00UL)
// #define DMA1_BASE             (AHB1PERIPH_BASE + 0x6000UL)
// #define DMA1_Stream0_BASE     (DMA1_BASE + 0x010UL)
// #define DMA1_Stream1_BASE     (DMA1_BASE + 0x028UL)
// #define DMA1_Stream2_BASE     (DMA1_BASE + 0x040UL)
// #define DMA1_Stream3_BASE     (DMA1_BASE + 0x058UL)
// #define DMA1_Stream4_BASE     (DMA1_BASE + 0x070UL)
// #define DMA1_Stream5_BASE     (DMA1_BASE + 0x088UL)
// #define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0UL)
// #define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8UL)
// #define DMA2_BASE             (AHB1PERIPH_BASE + 0x6400UL)
// #define DMA2_Stream0_BASE     (DMA2_BASE + 0x010UL)
// #define DMA2_Stream1_BASE     (DMA2_BASE + 0x028UL)
// #define DMA2_Stream2_BASE     (DMA2_BASE + 0x040UL)
// #define DMA2_Stream3_BASE     (DMA2_BASE + 0x058UL)
// #define DMA2_Stream4_BASE     (DMA2_BASE + 0x070UL)
// #define DMA2_Stream5_BASE     (DMA2_BASE + 0x088UL)
// #define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0UL)
// #define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8UL)


// /*!< Debug MCU registers base address */
// #define DBGMCU_BASE           0xE0042000UL
// /*!< USB registers base address */
// #define USB_OTG_FS_PERIPH_BASE               0x50000000UL

// #define USB_OTG_GLOBAL_BASE                  0x000UL
// #define USB_OTG_DEVICE_BASE                  0x800UL
// #define USB_OTG_IN_ENDPOINT_BASE             0x900UL
// #define USB_OTG_OUT_ENDPOINT_BASE            0xB00UL
// #define USB_OTG_EP_REG_SIZE                  0x20UL
// #define USB_OTG_HOST_BASE                    0x400UL
// #define USB_OTG_HOST_PORT_BASE               0x440UL
// #define USB_OTG_HOST_CHANNEL_BASE            0x500UL
// #define USB_OTG_HOST_CHANNEL_SIZE            0x20UL
// #define USB_OTG_PCGCCTL_BASE                 0xE00UL
// #define USB_OTG_FIFO_BASE                    0x1000UL
// #define USB_OTG_FIFO_SIZE                    0x1000UL

// #define UID_BASE                     0x1FFF7A10UL           /*!< Unique device ID register base address */
// #define FLASHSIZE_BASE               0x1FFF7A22UL           /*!< FLASH Size register base address       */
// #define PACKAGE_BASE                 0x1FFF7BF0UL           /*!< Package size register base address     */
// /**
//   * @}
//   */

extern TIM_TypeDef TIM2_obj;
extern TIM_TypeDef TIM3_obj;
extern TIM_TypeDef TIM4_obj;
extern TIM_TypeDef TIM5_obj;
extern RTC_TypeDef RTC_obj;
extern WWDG_TypeDef WWDG_obj;
extern IWDG_TypeDef IWDG_obj;
extern SPI_TypeDef I2S2ext_obj;
extern SPI_TypeDef SPI2_obj;
extern SPI_TypeDef SPI3_obj;
extern SPI_TypeDef I2S3ext_obj;
extern USART_TypeDef USART2_obj;
extern I2C_TypeDef I2C1_obj;
extern I2C_TypeDef I2C2_obj;
extern I2C_TypeDef I2C3_obj;
extern PWR_TypeDef PWR_obj;
extern TIM_TypeDef TIM1_obj;
extern USART_TypeDef USART1_obj;
extern USART_TypeDef USART6_obj;
extern ADC_TypeDef ADC1_obj;
extern ADC_Common_TypeDef ADC1_COMMON_obj;
extern SDIO_TypeDef SDIO_obj;
extern SPI_TypeDef SPI1_obj;
extern SPI_TypeDef SPI4_obj;
extern SYSCFG_TypeDef SYSCFG_obj;
extern EXTI_TypeDef EXTI_obj;
extern TIM_TypeDef TIM9_obj;
extern TIM_TypeDef TIM10_obj;
extern TIM_TypeDef TIM11_obj;
extern GPIO_TypeDef GPIOA_obj;
extern GPIO_TypeDef GPIOB_obj;
extern GPIO_TypeDef GPIOC_obj;
extern GPIO_TypeDef GPIOD_obj;
extern GPIO_TypeDef GPIOE_obj;
extern GPIO_TypeDef GPIOH_obj;
extern CRC_TypeDef CRC_obj;
extern RCC_TypeDef RCC_obj;
extern FLASH_TypeDef FLASH_obj;
extern DMA_TypeDef DMA1_obj;
extern DMA_Stream_TypeDef DMA1_Stream0_obj;
extern DMA_Stream_TypeDef DMA1_Stream1_obj;
extern DMA_Stream_TypeDef DMA1_Stream2_obj;
extern DMA_Stream_TypeDef DMA1_Stream3_obj;
extern DMA_Stream_TypeDef DMA1_Stream4_obj;
extern DMA_Stream_TypeDef DMA1_Stream5_obj;
extern DMA_Stream_TypeDef DMA1_Stream6_obj;
extern DMA_Stream_TypeDef DMA1_Stream7_obj;
extern DMA_TypeDef DMA2_obj;
extern DMA_Stream_TypeDef DMA2_Stream0_obj;
extern DMA_Stream_TypeDef DMA2_Stream1_obj;
extern DMA_Stream_TypeDef DMA2_Stream2_obj;
extern DMA_Stream_TypeDef DMA2_Stream3_obj;
extern DMA_Stream_TypeDef DMA2_Stream4_obj;
extern DMA_Stream_TypeDef DMA2_Stream5_obj;
extern DMA_Stream_TypeDef DMA2_Stream6_obj;
extern DMA_Stream_TypeDef DMA2_Stream7_obj;
extern DBGMCU_TypeDef DBGMCU_obj;
extern USB_OTG_GlobalTypeDef USB_OTG_FS_obj;

/** @addtogroup Peripheral_declaration
  * @{
  */  
#define TIM2                ((TIM_TypeDef *) &TIM2_obj)
#define TIM3                ((TIM_TypeDef *) &TIM3_obj)
#define TIM4                ((TIM_TypeDef *) &TIM4_obj)
#define TIM5                ((TIM_TypeDef *) &TIM5_obj)
#define RTC                 ((RTC_TypeDef *) &RTC_obj)
#define WWDG                ((WWDG_TypeDef *) &WWDG_obj)
#define IWDG                ((IWDG_TypeDef *) &IWDG_obj)
#define I2S2ext             ((SPI_TypeDef *) &I2S2ext_obj)
#define SPI2                ((SPI_TypeDef *) &SPI2_obj)
#define SPI3                ((SPI_TypeDef *) &SPI3_obj)
#define I2S3ext             ((SPI_TypeDef *) &I2S3ext_obj)
#define USART2              ((USART_TypeDef *) &USART2_obj)
#define I2C1                ((I2C_TypeDef *) &I2C1_obj)
#define I2C2                ((I2C_TypeDef *) &I2C2_obj)
#define I2C3                ((I2C_TypeDef *) &I2C3_obj)
#define PWR                 ((PWR_TypeDef *) &PWR_obj)
#define TIM1                ((TIM_TypeDef *) &TIM1_obj)
#define USART1              ((USART_TypeDef *) &USART1_obj)
#define USART6              ((USART_TypeDef *) &USART6_obj)
#define ADC1                ((ADC_TypeDef *) &ADC1_obj)
#define ADC1_COMMON         ((ADC_Common_TypeDef *) &ADC1_COMMON_obj)
#define ADC                  ADC1_COMMON
#define SDIO                ((SDIO_TypeDef *) &SDIO_obj)
#define SPI1                ((SPI_TypeDef *) &SPI1_obj)
#define SPI4                ((SPI_TypeDef *) &SPI4_obj)
#define SYSCFG              ((SYSCFG_TypeDef *) &SYSCFG_obj)
#define EXTI                ((EXTI_TypeDef *) &EXTI_obj)
#define TIM9                ((TIM_TypeDef *) &TIM9_obj)
#define TIM10               ((TIM_TypeDef *) &TIM10_obj)
#define TIM11               ((TIM_TypeDef *) &TIM11_obj)
#define GPIOA               ((GPIO_TypeDef *) &GPIOA_obj)
#define GPIOB               ((GPIO_TypeDef *) &GPIOB_obj)
#define GPIOC               ((GPIO_TypeDef *) &GPIOC_obj)
#define GPIOD               ((GPIO_TypeDef *) &GPIOD_obj)
#define GPIOE               ((GPIO_TypeDef *) &GPIOE_obj)
#define GPIOH               ((GPIO_TypeDef *) &GPIOH_obj)
#define CRC                 ((CRC_TypeDef *) &CRC_obj)
#define RCC                 ((RCC_TypeDef *) &RCC_obj)
#define FLASH               ((FLASH_TypeDef *) &FLASH_obj)
#define DMA1                ((DMA_TypeDef *) &DMA1_obj)
#define DMA1_Stream0        ((DMA_Stream_TypeDef *) &DMA1_Stream0_obj)
#define DMA1_Stream1        ((DMA_Stream_TypeDef *) &DMA1_Stream1_obj)
#define DMA1_Stream2        ((DMA_Stream_TypeDef *) &DMA1_Stream2_obj)
#define DMA1_Stream3        ((DMA_Stream_TypeDef *) &DMA1_Stream3_obj)
#define DMA1_Stream4        ((DMA_Stream_TypeDef *) &DMA1_Stream4_obj)
#define DMA1_Stream5        ((DMA_Stream_TypeDef *) &DMA1_Stream5_obj)
#define DMA1_Stream6        ((DMA_Stream_TypeDef *) &DMA1_Stream6_obj)
#define DMA1_Stream7        ((DMA_Stream_TypeDef *) &DMA1_Stream7_obj)
#define DMA2                ((DMA_TypeDef *) &DMA2_obj)
#define DMA2_Stream0        ((DMA_Stream_TypeDef *) &DMA2_Stream0_obj)
#define DMA2_Stream1        ((DMA_Stream_TypeDef *) &DMA2_Stream1_obj)
#define DMA2_Stream2        ((DMA_Stream_TypeDef *) &DMA2_Stream2_obj)
#define DMA2_Stream3        ((DMA_Stream_TypeDef *) &DMA2_Stream3_obj)
#define DMA2_Stream4        ((DMA_Stream_TypeDef *) &DMA2_Stream4_obj)
#define DMA2_Stream5        ((DMA_Stream_TypeDef *) &DMA2_Stream5_obj)
#define DMA2_Stream6        ((DMA_Stream_TypeDef *) &DMA2_Stream6_obj)
#define DMA2_Stream7        ((DMA_Stream_TypeDef *) &DMA2_Stream7_obj)
#define DBGMCU              ((DBGMCU_TypeDef *) &DBGMCU_obj)
#define USB_OTG_FS          ((USB_OTG_GlobalTypeDef *) &USB_OTG_FS_obj)

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME                40U /*!< LSI Maximum startup time in us */
/**
  * @}
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */
    
/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for ADC_SR register  ********************/
#define ADC_SR_AWD_Pos            (0U)                                         
#define ADC_SR_AWD_Msk            (0x1UL << ADC_SR_AWD_Pos)                     /*!< 0x00000001 */
#define ADC_SR_AWD                ADC_SR_AWD_Msk                               /*!<Analog watchdog flag */
#define ADC_SR_EOC_Pos            (1U)                                         
#define ADC_SR_EOC_Msk            (0x1UL << ADC_SR_EOC_Pos)                     /*!< 0x00000002 */
#define ADC_SR_EOC                ADC_SR_EOC_Msk                               /*!<End of conversion */
#define ADC_SR_JEOC_Pos           (2U)                                         
#define ADC_SR_JEOC_Msk           (0x1UL << ADC_SR_JEOC_Pos)                    /*!< 0x00000004 */
#define ADC_SR_JEOC               ADC_SR_JEOC_Msk                              /*!<Injected channel end of conversion */
#define ADC_SR_JSTRT_Pos          (3U)                                         
#define ADC_SR_JSTRT_Msk          (0x1UL << ADC_SR_JSTRT_Pos)                   /*!< 0x00000008 */
#define ADC_SR_JSTRT              ADC_SR_JSTRT_Msk                             /*!<Injected channel Start flag */
#define ADC_SR_STRT_Pos           (4U)                                         
#define ADC_SR_STRT_Msk           (0x1UL << ADC_SR_STRT_Pos)                    /*!< 0x00000010 */
#define ADC_SR_STRT               ADC_SR_STRT_Msk                              /*!<Regular channel Start flag */
#define ADC_SR_OVR_Pos            (5U)                                         
#define ADC_SR_OVR_Msk            (0x1UL << ADC_SR_OVR_Pos)                     /*!< 0x00000020 */
#define ADC_SR_OVR                ADC_SR_OVR_Msk                               /*!<Overrun flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define ADC_CR1_AWDCH_Pos         (0U)                                         
#define ADC_CR1_AWDCH_Msk         (0x1FUL << ADC_CR1_AWDCH_Pos)                 /*!< 0x0000001F */
#define ADC_CR1_AWDCH             ADC_CR1_AWDCH_Msk                            /*!<AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_CR1_AWDCH_0           (0x01UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000001 */
#define ADC_CR1_AWDCH_1           (0x02UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000002 */
#define ADC_CR1_AWDCH_2           (0x04UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000004 */
#define ADC_CR1_AWDCH_3           (0x08UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000008 */
#define ADC_CR1_AWDCH_4           (0x10UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000010 */
#define ADC_CR1_EOCIE_Pos         (5U)                                         
#define ADC_CR1_EOCIE_Msk         (0x1UL << ADC_CR1_EOCIE_Pos)                  /*!< 0x00000020 */
#define ADC_CR1_EOCIE             ADC_CR1_EOCIE_Msk                            /*!<Interrupt enable for EOC */
#define ADC_CR1_AWDIE_Pos         (6U)                                         
#define ADC_CR1_AWDIE_Msk         (0x1UL << ADC_CR1_AWDIE_Pos)                  /*!< 0x00000040 */
#define ADC_CR1_AWDIE             ADC_CR1_AWDIE_Msk                            /*!<AAnalog Watchdog interrupt enable */
#define ADC_CR1_JEOCIE_Pos        (7U)                                         
#define ADC_CR1_JEOCIE_Msk        (0x1UL << ADC_CR1_JEOCIE_Pos)                 /*!< 0x00000080 */
#define ADC_CR1_JEOCIE            ADC_CR1_JEOCIE_Msk                           /*!<Interrupt enable for injected channels */
#define ADC_CR1_SCAN_Pos          (8U)                                         
#define ADC_CR1_SCAN_Msk          (0x1UL << ADC_CR1_SCAN_Pos)                   /*!< 0x00000100 */
#define ADC_CR1_SCAN              ADC_CR1_SCAN_Msk                             /*!<Scan mode */
#define ADC_CR1_AWDSGL_Pos        (9U)                                         
#define ADC_CR1_AWDSGL_Msk        (0x1UL << ADC_CR1_AWDSGL_Pos)                 /*!< 0x00000200 */
#define ADC_CR1_AWDSGL            ADC_CR1_AWDSGL_Msk                           /*!<Enable the watchdog on a single channel in scan mode */
#define ADC_CR1_JAUTO_Pos         (10U)                                        
#define ADC_CR1_JAUTO_Msk         (0x1UL << ADC_CR1_JAUTO_Pos)                  /*!< 0x00000400 */
#define ADC_CR1_JAUTO             ADC_CR1_JAUTO_Msk                            /*!<Automatic injected group conversion */
#define ADC_CR1_DISCEN_Pos        (11U)                                        
#define ADC_CR1_DISCEN_Msk        (0x1UL << ADC_CR1_DISCEN_Pos)                 /*!< 0x00000800 */
#define ADC_CR1_DISCEN            ADC_CR1_DISCEN_Msk                           /*!<Discontinuous mode on regular channels */
#define ADC_CR1_JDISCEN_Pos       (12U)                                        
#define ADC_CR1_JDISCEN_Msk       (0x1UL << ADC_CR1_JDISCEN_Pos)                /*!< 0x00001000 */
#define ADC_CR1_JDISCEN           ADC_CR1_JDISCEN_Msk                          /*!<Discontinuous mode on injected channels */
#define ADC_CR1_DISCNUM_Pos       (13U)                                        
#define ADC_CR1_DISCNUM_Msk       (0x7UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x0000E000 */
#define ADC_CR1_DISCNUM           ADC_CR1_DISCNUM_Msk                          /*!<DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_CR1_DISCNUM_0         (0x1UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x00002000 */
#define ADC_CR1_DISCNUM_1         (0x2UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x00004000 */
#define ADC_CR1_DISCNUM_2         (0x4UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x00008000 */
#define ADC_CR1_JAWDEN_Pos        (22U)                                        
#define ADC_CR1_JAWDEN_Msk        (0x1UL << ADC_CR1_JAWDEN_Pos)                 /*!< 0x00400000 */
#define ADC_CR1_JAWDEN            ADC_CR1_JAWDEN_Msk                           /*!<Analog watchdog enable on injected channels */
#define ADC_CR1_AWDEN_Pos         (23U)                                        
#define ADC_CR1_AWDEN_Msk         (0x1UL << ADC_CR1_AWDEN_Pos)                  /*!< 0x00800000 */
#define ADC_CR1_AWDEN             ADC_CR1_AWDEN_Msk                            /*!<Analog watchdog enable on regular channels */
#define ADC_CR1_RES_Pos           (24U)                                        
#define ADC_CR1_RES_Msk           (0x3UL << ADC_CR1_RES_Pos)                    /*!< 0x03000000 */
#define ADC_CR1_RES               ADC_CR1_RES_Msk                              /*!<RES[2:0] bits (Resolution) */
#define ADC_CR1_RES_0             (0x1UL << ADC_CR1_RES_Pos)                    /*!< 0x01000000 */
#define ADC_CR1_RES_1             (0x2UL << ADC_CR1_RES_Pos)                    /*!< 0x02000000 */
#define ADC_CR1_OVRIE_Pos         (26U)                                        
#define ADC_CR1_OVRIE_Msk         (0x1UL << ADC_CR1_OVRIE_Pos)                  /*!< 0x04000000 */
#define ADC_CR1_OVRIE             ADC_CR1_OVRIE_Msk                            /*!<overrun interrupt enable */
  
